# Размер блока в байтах (128 бит)
BLOCK_SIZE = 16

# Поддерживаемые размеры ключа в байтах (128/192/256 бит)
KEY_SIZES = [16, 24, 32]

# Количество раундов
ROUNDS = 16

# Все возможные неприводимые полиномы для GF(2^8)
GF256_POLYNOMIALS = [
    0x11B,  # x^8 + x^4 + x^3 + x + 1 (используется в AES)
    0x11D,  # x^8 + x^4 + x^3 + x^2 + 1
    0x12B,  # x^8 + x^5 + x^3 + x + 1
    0x12D,  # x^8 + x^5 + x^3 + x^2 + 1
    0x14D,  # x^8 + x^6 + x^3 + x^2 + 1
    0x15F,  # x^8 + x^6 + x^4 + x^3 + x^2 + x + 1
    0x163,  # x^8 + x^6 + x^5 + x + 1
    0x165,  # x^8 + x^6 + x^5 + x^2 + 1
    0x169,  # x^8 + x^6 + x^5 + x^3 + 1
    0x171,  # x^8 + x^6 + x^5 + x^4 + 1
    0x187,  # x^8 + x^7 + x^2 + x + 1
    0x18D,  # x^8 + x^7 + x^3 + x^2 + 1
    0x1A9,  # x^8 + x^7 + x^5 + x^3 + 1
    0x1C3,  # x^8 + x^7 + x^6 + x + 1
    0x1CF,  # x^8 + x^7 + x^6 + x^3 + x^2 + x + 1
    0x1E7,  # x^8 + x^7 + x^6 + x^5 + x^2 + x + 1
    0x1F5,  # x^8 + x^7 + x^6 + x^5 + x^4 + x^2 + 1
]
